Classes | Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::AngleSetBase Class Reference
MEP Element Manager
The AngleSetBase represents a named table, and it contains angles which are used as keys in the PreferenceTables. By default, Archicad will provide you the Angle angleSet, but you can choose your own by renaming it and populate it with your desired values. More...
#include <MEPAngleSetBase.hpp>
 Inheritance diagram for ACAPI::MEP::AngleSetBase:
 Classes
class  | Modifier
Modifier of the AngleSetBase. More...
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< double >  | GetAngle (uint32_t index) const
Result< bool >  | IsAngleDefined (uint32_t index) const
Checks whether an entry from the angleSet is defined. A angle is defined if at least one preferenceTable has values associated to it.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
AngleSetBase (std::shared_ptr< Impl::IAngleSetBaseImpl > impl)
Constructs a AngleSetBase with the given base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The AngleSetBase represents a named table, and it contains angles which are used as keys in the PreferenceTables. By default, Archicad will provide you the Angle angleSet, but you can choose your own by renaming it and populate it with your desired values.
Since
Archicad 29
The entries of the set have to be unique and are always in ascending order. Entries that are defined in PreferenceTables cannot be deleted.
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<DuctAngleSet> ductAngleSet = GetDuctAngleSet ();
 if (ductAngleSet.IsErr ())
 return ductAngleSet.UnwrapErr ().kind;
 preferenceReporter.SetTabCount (1);
 preferenceReporter.Add ("Duct Angle Set");
 uint32_t angleCount = ductAngleSet->GetSize ();
 preferenceReporter.SetTabCount (2);
 for (uint32_t i = 0; i < angleCount; ++i) {
 preferenceReporter.Add ("Angle", *ductAngleSet->GetAngle (i));
 }
 Modification
 Reporter preferenceReporter;
 ACAPI::Result<PipeAngleSet> referenceSet = GetPipeAngleSet ();
 if (referenceSet.IsErr ())
 return referenceSet.UnwrapErr ().kind;
 // SetName
 preferenceReporter.Add ("Renaming the Angle Set...");
 referenceSet->Modify ([&] (ACAPI::MEP::AngleSetBase::Modifier& modifier) {
 modifier.SetName ("Not Angle");
 }, "Modify the name of Angle Set.");
 // Addition
 preferenceReporter.Add ("Adding new Angles to the Angle Set...");
 referenceSet->Modify ([&] (AngleSetBase::Modifier& modifier) {
 const auto& Add = ([&] (double angle)
 {
 preferenceReporter.Add ("Trying to add " + GS::ValueToUniString (angle));
 ACAPI::Result<uint32_t> addRes = modifier.Add (angle);
 if (addRes.IsOk ())
 preferenceReporter.Add ("Angle successfully added!");
 else
 preferenceReporter.Add (GS::UniString (addRes.UnwrapErr ().text));
 });
 Add (35.0);
 Add (70.0);
 Add (80.0);
 }, "Add new values to the Angle Set.");
 // Deletion
 const auto ReportDeletion = [&] (const ACAPI::Result<void>& deletionResult) {
 if (deletionResult.IsOk ())
 preferenceReporter.Add ("Deletion was successful.");
 else
 preferenceReporter.Add ("Deletion unsuccessful", GS::UniString (deletionResult.UnwrapErr ().text));
 };
 // Deleting an unused Angle
 preferenceReporter.Add ("Deleting Angle 70.0, which is unused");
 referenceSet->Modify ([&] (ACAPI::MEP::AngleSetBase::Modifier& modifier) {
 ACAPI::Result<void> res = modifier.Delete (70.0);
 ReportDeletion (res);
 }, "Delete an unused value from the Angle Set.");
Constructor & Destructor Documentation
◆ AngleSetBase()
 ACAPI::MEP::AngleSetBase::AngleSetBase  |  ( |  std::shared_ptr< Impl::IAngleSetBaseImpl > |  impl | )
protected
Constructs a AngleSetBase with the given base implementation.
Parameters
impl | The given base implementation.
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::AngleSetBase::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ GetAngle()
 Result< double > ACAPI::MEP::AngleSetBase::GetAngle  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns the angle of the row identified by index.
◆ GetName()
 GS::UniString ACAPI::MEP::AngleSetBase::GetName  |  ( |   | ) |   const
Returns
Returns the name of the angleSet.
◆ GetSize()
 uint32_t ACAPI::MEP::AngleSetBase::GetSize  |  ( |   | ) |   const
Returns
Returns the size of the angleSet.
◆ IsAngleDefined()
 Result< bool > ACAPI::MEP::AngleSetBase::IsAngleDefined  |  ( |  uint32_t |  index | ) |   const
Checks whether an entry from the angleSet is defined. A angle is defined if at least one preferenceTable has values associated to it.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns whether the row identified by index is defined.
◆ IsEditable()
 Result< void > ACAPI::MEP::AngleSetBase::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::AngleSetBase::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.